In [2]:
import pandas as pd

# Series

In [5]:
pd.Series([1,2,3,4,5])

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [11]:
index_s = ['a','b','c','d','e'] 
ser = pd.Series([1,2,3,4,5], index = index_s)
ser

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [15]:
ser[0], ser['a']

C:\Users\Admin\AppData\Local\Temp\ipykernel_1524\1772165095.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  ser[0], ser['a']

(np.int64(1), np.int64(1))

In [16]:
# 딕셔너리로 시리즈 생성 - 키가 인덱스가 됨
dict_data = {'a':1, 'b':2, 'c':3, 'd':4}
s3 = pd.Series(dict_data)
print(s3)

a    1
b    2
c    3
d    4
dtype: int64

In [17]:
ser2 = pd.Series([10, 'banana'])
type(ser2), ser2

(pandas.core.series.Series,
 0        10
 1    banana
 dtype: object)

In [21]:
population = pd.Series([9776, 2729, 1566, 3158], 
                    index=['서울', '부산', '인천', '대구'])
print(population['서울'])  # 9776 출력

9776

In [22]:
print(population[['서울', '부산']])  # 서울과 부산의 데이터만 선택

서울    9776
부산    2729
dtype: int64

In [24]:
population.info()

<class 'pandas.core.series.Series'>
Index: 4 entries, 서울 to 대구
Series name: None
Non-Null Count  Dtype
--------------  -----
4 non-null      int64
dtypes: int64(1)
memory usage: 236.0+ bytes

In [30]:
ser.iloc[1], ser.loc['a']

(np.int64(2), np.int64(1))

# DataFrame

In [35]:
scientists = pd.DataFrame({
        "Name": ["Rosaline Franklin", "William Gosset"],
        "Occupation": ["Chemist", "Statistician"],
        "Born": ["1920-07-25", "1876-06-13"],
        "Died": ["1958-04-16", "1937-10-16"],
        "Age": [37, 61],
}) # , ['Death', 'Alive'])
scientists

                Name    Occupation        Born        Died  Age
0  Rosaline Franklin       Chemist  1920-07-25  1958-04-16   37
1     William Gosset  Statistician  1876-06-13  1937-10-16   61

In [23]:
scientists.columns

Index(['Name', 'Occupation', 'Born', 'Died', 'Age'], dtype='object')

In [24]:
scientists.iloc[0]

Name          Rosaline Franklin
Occupation              Chemist
Born                 1920-07-25
Died                 1958-04-16
Age                          37
Name: 0, dtype: object

In [25]:
scientists['Name']

0    Rosaline Franklin
1       William Gosset
Name: Name, dtype: object

In [46]:
scientists.index =  ['Rosaline Franklin', 'William Gosset']

In [48]:
scientists

,Name,Occupation,Born,Died,Age
Rosaline Franklin,Rosaline Franklin,Chemist,1920-07-25,1958-04-16,37
William Gosset,William Gosset,Statistician,1876-06-13,1937-10-16,61

In [47]:
# 인덱스로 행추출
scientists.loc['William Gosset']

Name          William Gosset
Occupation      Statistician
Born              1876-06-13
Died              1937-10-16
Age                       61
Name: William Gosset, dtype: object

In [50]:
scientists.loc['Rosaline Franklin','Born']

'1920-07-25'

In [51]:
#[시작행:끝행, 시작열:끝열]  #쉼표는 행과열 > 차원을 구분
scientists.iloc[:, 0:2]

                                Name    Occupation
Rosaline Franklin  Rosaline Franklin       Chemist
William Gosset        William Gosset  Statistician

In [6]:
scientists.index

RangeIndex(start=0, stop=2, step=1)

In [31]:
scientists.iloc[:,0:2]

                    Name    Occupation
Alive  Rosaline Franklin       Chemist
Death     William Gosset  Statistician

In [7]:
scientists.iloc[0]

Name          Rosaline Franklin
Occupation              Chemist
Born                 1920-07-25
Died                 1958-04-16
Age                          37
Name: 0, dtype: object

# 데이터 선택 및 필터링 (Indexing & Slicing)

iloc[ ] => indexlocator   
loc[ ] =>  locator

In [75]:
# 리스트로 데이터프레임 생성
data = [[1, 2, 3],
        [4, 5, 6],
        [7, 8, 9]]

df = pd.DataFrame(data)
print(df)

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [77]:
df.iloc[0,2]

np.int64(3)

In [89]:
# 열 이름 지정하여 생성
df = pd.DataFrame(data, columns=['A', 'B', 'C'])
print(df)

   A  B  C
0  1  2  3
1  4  5  6
2  7  8  9

In [93]:
df.loc[: ,'A']

0    1
1    4
2    7
Name: A, dtype: int64

In [90]:
df.loc[1,'A']

np.int64(4)

In [82]:
df.iloc[2,:]

0    7
1    8
2    9
Name: 2, dtype: int64

In [66]:
df.loc[0]

A    1
B    2
C    3
Name: 0, dtype: int64

In [72]:
df.loc[0,'C']

np.int64(3)

In [69]:
df.iloc[0]

A    1
B    2
C    3
Name: 0, dtype: int64

In [94]:
df.iloc[0,2]

np.int64(3)

In [37]:
sci1 = pd.DataFrame({
        "Name": ["Rosaline Franklin", "William Gosset"],
        "Occupation": ["Chemist", "Statistician"],
        "Born": ["1920-07-25", "1876-06-13"],
        "Died": ["1958-04-16", "1937-10-16"],
        "Age": [37, 61],
})
sci1

                Name    Occupation        Born        Died  Age
0  Rosaline Franklin       Chemist  1920-07-25  1958-04-16   37
1     William Gosset  Statistician  1876-06-13  1937-10-16   61

In [38]:
sci1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        2 non-null      object
 1   Occupation  2 non-null      object
 2   Born        2 non-null      object
 3   Died        2 non-null      object
 4   Age         2 non-null      int64
dtypes: int64(1), object(4)
memory usage: 212.0+ bytes

In [52]:
# iloc 로 william Gosset의 age 추출
sci1.iloc[1,4]

np.int64(61)

In [ ]:
#born, died 만 추출 (iloc)
sci1.iloc[:,2:4] #iloc

         Born        Died
0  1920-07-25  1958-04-16
1  1876-06-13  1937-10-16

In [54]:
#born, died 만 추출 (loc)
sci1.loc[:, 'Born':'Died']

         Born        Died
0  1920-07-25  1958-04-16
1  1876-06-13  1937-10-16

In [59]:
#occupation만 추출 (iloc)
sci1.iloc[:,1]

0         Chemist
1    Statistician
Name: Occupation, dtype: object

In [55]:
# occupation만 추출 (loc)
sci1.loc[:, 'Occupation']

0         Chemist
1    Statistician
Name: Occupation, dtype: object

In [102]:
sci1.loc[0, 'Name'] , sci1.loc[0, 'Occupation']

('Rosaline Franklin', 'Chemist')

In [103]:
sci1.loc[0]

Name          Rosaline Franklin
Occupation              Chemist
Born                 1920-07-25
Died                 1958-04-16
Age                          37
Name: 0, dtype: object

In [107]:
sci1.to_csv('./data/scientist_1.csv')

In [108]:
sci1.to_csv('./data/scientist_2.csv', index = False)

In [60]:
df = pd.read_csv('./data/scientist_2.csv')
df

                Name    Occupation        Born        Died  Age
0  Rosaline Franklin       Chemist  1920-07-25  1958-04-16   37
1     William Gosset  Statistician  1876-06-13  1937-10-16   61

In [115]:
df1 =  pd.read_csv('./data/scientists.csv')
df1

                   Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

In [ ]:
# pickle : 파이썬의 객체형을 저장 
sci1.to_pickle('./data/scientist.pickle')

In [ ]:
# pickle 읽어오기
pck = pd.read_pickle('./data/scientist.pickle')
pck

                Name    Occupation        Born        Died  Age
0  Rosaline Franklin       Chemist  1920-07-25  1958-04-16   37
1     William Gosset  Statistician  1876-06-13  1937-10-16   61

In [ ]:
df1.info()
# non-null > null이 얼마나 있나. dtype이 뭔지.
# info() : 데이터를 미리보는 함수. 어떤지.

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        8 non-null      object
 1   Born        8 non-null      object
 2   Died        8 non-null      object
 3   Age         8 non-null      int64
 4   Occupation  8 non-null      object
dtypes: int64(1), object(4)
memory usage: 452.0+ bytes

In [120]:
df1.head(3)

                   Name        Born        Died  Age    Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37       Chemist
1        William Gosset  1876-06-13  1937-10-16   61  Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90         Nurse

In [121]:
df1.tail(3)

           Name        Born        Died  Age          Occupation
5     John Snow  1813-03-15  1858-06-16   45           Physician
6   Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7  Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

In [124]:
# 기술통계를 확인하는 함수, 기술통계를 낼 수 있는 colum 들만 describe 해주는 함수
df1.describe()

             Age
count   8.000000
mean   59.125000
std    18.325918
min    37.000000
25%    44.000000
50%    58.500000
75%    68.750000
max    90.000000

In [126]:
df1['Age']

0    37
1    61
2    90
3    66
4    56
5    45
6    41
7    77
Name: Age, dtype: int64

In [128]:
df1.loc[:,'Age'].describe()

count     8.000000
mean     59.125000
std      18.325918
min      37.000000
25%      44.000000
50%      58.500000
75%      68.750000
max      90.000000
Name: Age, dtype: float64

In [61]:
import pandas as pd

# 샘플 데이터프레임 생성
data = {
    '이름': ['김철수', '이영희', '박민수', '정수진', '최영호', '한미래', '윤지원'],
    '나이': [25, 28, 22, 31, 27, 24, 29],
    '점수': [85, 92, 78, 95, 88, 73, 91]
}
df = pd.DataFrame(data)

# 처음 5개 행 보기
print("=== head() ===")
print(df.head())

# 마지막 3개 행 보기
print("\n=== tail(3) ===")
print(df.tail(3))

# 데이터프레임 기본 정보
print("\n=== info() ===")
print(df.info())

# 기술 통계량
print("\n=== describe() ===")
print(df.describe())

=== head() ===
    이름  나이  점수
0  김철수  25  85
1  이영희  28  92
2  박민수  22  78
3  정수진  31  95
4  최영호  27  88

=== tail(3) ===
    이름  나이  점수
4  최영호  27  88
5  한미래  24  73
6  윤지원  29  91

=== info() ===
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   이름      7 non-null      object
 1   나이      7 non-null      int64
 2   점수      7 non-null      int64
dtypes: int64(2), object(1)
memory usage: 300.0+ bytes
None

=== describe() ===
              나이         점수
count   7.000000   7.000000
mean   26.571429  86.000000
std     3.101459   7.958224
min    22.000000  73.000000
25%    24.500000  81.500000
50%    27.000000  88.000000
75%    28.500000  91.500000
max    31.000000  95.000000

In [138]:
df

    이름  나이  점수
0  김철수  25  85
1  이영희  28  92
2  박민수  22  78
3  정수진  31  95
4  최영호  27  88
5  한미래  24  73
6  윤지원  29  91

In [139]:
df.loc[:, '나이'].describe()

count     7.000000
mean     26.571429
std       3.101459
min      22.000000
25%      24.500000
50%      27.000000
75%      28.500000
max      31.000000
Name: 나이, dtype: float64

In [146]:
df.loc[:,'점수'].describe()

count     7.000000
mean     86.000000
std       7.958224
min      73.000000
25%      81.500000
50%      88.000000
75%      91.500000
max      95.000000
Name: 점수, dtype: float64

In [92]:
score_test = {
    '이름': ['김철수', '이영희', '박민수', '정수진', '최영호', '한미래', '윤지원'],
    '나이': [25, 28, 22, 31, 27, 24, 29],
    '점수': [85, 92, 78, 95, 88, 73, 91]
}

In [147]:
print(df.index)    # 행 이름 출력
print(df.columns)  # 열 이름 출력

RangeIndex(start=0, stop=7, step=1)
Index(['이름', '나이', '점수'], dtype='object')

In [148]:
df

    이름  나이  점수
0  김철수  25  85
1  이영희  28  92
2  박민수  22  78
3  정수진  31  95
4  최영호  27  88
5  한미래  24  73
6  윤지원  29  91

In [3]:
names = ['김철수', '이영희', '박민수', '정수진', '최영호', '한미래', '윤지원']
국어 = [50,80,40,40,80,20,50]
영어 = [60,90,50,50,90,80,50]
수학 = [70,100,40,70,40,70,80]

cs7 = pd.DataFrame([국어, 영어, 수학], index=['국어', '영어', '수학'], columns=names)
cs7

    김철수  이영희  박민수  정수진  최영호  한미래  윤지원
국어   50   80   40   40   80   20   50
영어   60   90   50   50   90   80   50
수학   70  100   40   70   40   70   80

In [4]:
df.index

NameError: name 'df' is not defined

In [65]:
df.columns

Index(['name', 'age', 'score'], dtype='object')

In [64]:
df.columns = ['name', 'age', 'score']

In [67]:
df

  name  age  score
0  김철수   25     85
1  이영희   28     92
2  박민수   22     78
3  정수진   31     95
4  최영호   27     88
5  한미래   24     73
6  윤지원   29     91

In [69]:
df.values

array([['김철수', 25, 85],
       ['이영희', 28, 92],
       ['박민수', 22, 78],
       ['정수진', 31, 95],
       ['최영호', 27, 88],
       ['한미래', 24, 73],
       ['윤지원', 29, 91]], dtype=object)

In [70]:
df.index

RangeIndex(start=0, stop=7, step=1)

In [72]:
# 행의 이름 변경
df.index = ['A','B','C','D','E','F','G']

In [76]:
#일부 열의 이름 변경
df.rename(columns={'name':'Name', 'age':'Age'}) # df(원본)가 바뀌는 것은 아니다.

  Name  Age  score
A  김철수   25     85
B  이영희   28     92
C  박민수   22     78
D  정수진   31     95
E  최영호   27     88
F  한미래   24     73
G  윤지원   29     91

In [77]:
df #원본

  name  age  score
A  김철수   25     85
B  이영희   28     92
C  박민수   22     78
D  정수진   31     95
E  최영호   27     88
F  한미래   24     73
G  윤지원   29     91

In [82]:
df.rename(index={'A':'a','B':'b'},inplace = True) # inplace = False 가 기본값이고 원본 데이터를 바꿀지 말지 정하는 속성
df

  name  age  score
a  김철수   25     85
b  이영희   28     92
C  박민수   22     78
D  정수진   31     95
E  최영호   27     88
F  한미래   24     73
G  윤지원   29     91

In [84]:
df1 = df.rename(index={'a':'A','b':'B'}) # (inplace = True 를 쓰는 방식보다는) 이 방식을 선호한다.
df1

  name  age  score
A  김철수   25     85
B  이영희   28     92
C  박민수   22     78
D  정수진   31     95
E  최영호   27     88
F  한미래   24     73
G  윤지원   29     91

# 행/열 추가

In [5]:
data = {
    '이름': ['김철수', '이영희', '박민수', '정수진', '최영호', '한미래', '윤지원'],
    '나이': [25, 28, 22, 31, 27, 24, 29],
    '점수': [85, 92, 78, 95, 88, 73, 91]
}
df = pd.DataFrame(data)
df

    이름  나이  점수
0  김철수  25  85
1  이영희  28  92
2  박민수  22  78
3  정수진  31  95
4  최영호  27  88
5  한미래  24  73
6  윤지원  29  91

In [6]:
df.iloc[0] # 행단위 인덱싱

이름    김철수
나이     25
점수     85
Name: 0, dtype: object

In [7]:
df.iloc[0:2] # 행단위 슬라이싱

    이름  나이  점수
0  김철수  25  85
1  이영희  28  92

In [8]:
df.loc[0] # 행단위는 iloc, 이름단위 loc

이름    김철수
나이     25
점수     85
Name: 0, dtype: object

In [9]:
df[ df['나이'] > 25] # 조건을 사용한 행 추출

    이름  나이  점수
1  이영희  28  92
3  정수진  31  95
4  최영호  27  88
6  윤지원  29  91

In [10]:
# 점수 > 90 인 행 추출
df[ df['점수'] > 90]

    이름  나이  점수
1  이영희  28  92
3  정수진  31  95
6  윤지원  29  91

In [11]:
# 새로운 행 추가  > loc[] 를 이용
df.loc[7] = ['홍길동', 30, 70] # 새로운 행 추가
# df.iloc[8] = ['대대대', 30, 100] # iloc는 ERROR #IndexError: iloc cannot enlarge its target object

In [12]:
df

    이름  나이  점수
0  김철수  25  85
1  이영희  28  92
2  박민수  22  78
3  정수진  31  95
4  최영호  27  88
5  한미래  24  73
6  윤지원  29  91
7  홍길동  30  70

In [13]:
# 열 추가
df.insert(loc = 3, column='몸무게', value=[30,40,50,20,25,23,24,25])

In [14]:
#일부 열의 이름 변경
df.rename(columns={'몸무게':'점수'})

    이름  나이  점수  점수
0  김철수  25  85  30
1  이영희  28  92  40
2  박민수  22  78  50
3  정수진  31  95  20
4  최영호  27  88  25
5  한미래  24  73  23
6  윤지원  29  91  24
7  홍길동  30  70  25

In [15]:
# 열 추가
df.insert(loc = 3, column='age', value=[30,40,50,20,25,23,24,25])
df

    이름  나이  점수  age  몸무게
0  김철수  25  85   30   30
1  이영희  28  92   40   40
2  박민수  22  78   50   50
3  정수진  31  95   20   20
4  최영호  27  88   25   25
5  한미래  24  73   23   23
6  윤지원  29  91   24   24
7  홍길동  30  70   25   25

In [16]:
df
#일부 열의 이름 변경
df.rename(columns={'age':'나이'})

    이름  나이  점수  나이  몸무게
0  김철수  25  85  30   30
1  이영희  28  92  40   40
2  박민수  22  78  50   50
3  정수진  31  95  20   20
4  최영호  27  88  25   25
5  한미래  24  73  23   23
6  윤지원  29  91  24   24
7  홍길동  30  70  25   25

In [17]:
df['grade'] = ['A','A','B','F','F','B','C','A']

In [206]:
#일부 열의 이름 변경
df.rename(columns={'age':'나이'})
df

    이름  나이  점수  age  몸무게 grade
0  김철수  25  85   30   30     A
1  이영희  28  92   40   40     A
2  박민수  22  78   50   50     B
3  정수진  31  95   20   20     F
4  최영호  27  88   25   25     F
5  한미래  24  73   23   23     B
6  윤지원  29  91   24   24     C
7  홍길동  30  70   25   25     A

# 행/열 삭제

In [180]:
# 인덱스로 행 삭제
df1 = df.drop(7, axis=0)  # 7 인덱스의 행 삭제 (7. 홍길동 삭제)
df1

    이름  나이  점수  몸무게 grade
0  김철수  25  85   30     A
1  이영희  28  92   40     A
2  박민수  22  78   50     B
3  정수진  31  95   20     F
4  최영호  27  88   25     F
5  한미래  24  73   23     B
6  윤지원  29  91   24     C

In [141]:
# 여러 행 한 번에 삭제
df2 = df.drop([1, 2], axis=0)
df2

    이름  나이  점수  몸무게 grade
0  김철수  25  85   30     A
3  정수진  31  95   20     F
4  최영호  27  88   25     F
5  한미래  24  73   23     B
6  윤지원  29  91   24     C
7  홍길동  30  70   25     A

In [142]:
# 열 이름으로 열 삭제
df3 = df.drop('grade', axis=1)  # 'grade' 열 삭제
df3

    이름  나이  점수  몸무게
0  김철수  25  85   30
1  이영희  28  92   40
2  박민수  22  78   50
3  정수진  31  95   20
4  최영호  27  88   25
5  한미래  24  73   23
6  윤지원  29  91   24
7  홍길동  30  70   25

In [144]:
# 여러 열 한 번에 삭제
df4 = df.drop(['나이', '몸무게'], axis=1)
df4

    이름  점수 grade
0  김철수  85     A
1  이영희  92     A
2  박민수  78     B
3  정수진  95     F
4  최영호  88     F
5  한미래  73     B
6  윤지원  91     C
7  홍길동  70     A

In [182]:
df

    이름  나이  점수  몸무게 grade
0  김철수  25  85   30     A
1  이영희  28  92   40     A
2  박민수  22  78   50     B
3  정수진  31  95   20     F
4  최영호  27  88   25     F
5  한미래  24  73   23     B
6  윤지원  29  91   24     C
7  홍길동  30  70   25     A

### 데이터형 변환

In [207]:
df = df.astype({'나이': str, '몸무게':float})

In [208]:
# 문자열로 변환
df['점수'] = df['점수'].astype(str)

In [ ]:
# # 날짜형으로 변환
# df['date'] = pd.to_datetime(df['date'])

### 인덱스의 설정

In [ ]:
df.set_index('student_id', inplace=True)
df

Index([0, 1, 2, 3, 4, 5, 6, 7], dtype='int64')

In [22]:
dates = pd.date_range('2025-01-01', periods=8, freq='D')
dates

DatetimeIndex(['2025-01-01', '2025-01-02', '2025-01-03', '2025-01-04',
               '2025-01-05', '2025-01-06', '2025-01-07', '2025-01-08'],
              dtype='datetime64[ns]', freq='D')

In [26]:
df_date = df['dates'] = dates

In [30]:
df

    이름  나이  점수  age  몸무게 grade      dates
0  김철수  25  85   30   30     A 2025-01-01
1  이영희  28  92   40   40     A 2025-01-02
2  박민수  22  78   50   50     B 2025-01-03
3  정수진  31  95   20   20     F 2025-01-04
4  최영호  27  88   25   25     F 2025-01-05
5  한미래  24  73   23   23     B 2025-01-06
6  윤지원  29  91   24   24     C 2025-01-07
7  홍길동  30  70   25   25     A 2025-01-08